
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресПроизвольныхДанных") Тогда
		АдресПроизвольныхДанных = Параметры.АдресПроизвольныхДанных;
	КонецЕсли;
	
	Ар_ИнформационныеБазы.ЗаполнитьТаблицуФормыКластераИзПроизвольныхДанных(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Таблица.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Данные = ТекущиеДанные[Поле.Заголовок];
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			
			Массив = Новый Массив();
			Массив.Добавить(Данные);
			
			ПараметрыОткрытия 	= Новый Структура();
			ПараметрыОткрытия.Вставить("АдресПроизвольныхДанных", ПоместитьВоВременноеХранилище(Массив));
			
			ОткрытьФорму("Справочник.Ар_ИнформационныеБазы.Форма.Кластер_Сеансы", ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
