
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ВыгрузитьКонфигурацииНаКлиенте(ПараметрКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКонфигурацииНаКлиенте(Массив)
	
	Данные 					= Ар_ОбщегоНазначенияКлиент.ИнициализироватьСтруктуруДиалогаВыбораФайла();
	Диалог 					= Ар_ОбщегоНазначенияКлиент.ПолучитьДиалогВыбораКаталога(Данные);
	
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ВыгрузитьКонфигурацииЗавершениеНаКлиенте", ЭтотОбъект, Массив);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКонфигурацииЗавершениеНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Путь = Результат[0];
		Иначе
			Путь = Результат;
		КонецЕсли;
		
		Для Каждого Конфигурация Из ДополнительныеПараметры Цикл
			
			Отказ 				= Ложь;
			Данные 				= Ар_РаботаСКоманднойСтрокойВызовСервера.ПолучитьСтруктуруДанныхПоКонфигурации(Конфигурация);
			Данные.Путь 		= Путь;
			Данные.ПутьФайла 	= СтрШаблон("%1\%2_%3.cf", Данные.Путь, Конфигурация, Формат(ТекущаяДата(), "ДФ=yy_MM_dd"));
			
			Если Данные.ПолучатьИзмененияИзХранилища Тогда
				
				Ар_РаботаСКоманднойСтрокойКлиентСервер.ВыгрузитьКонфигурациюВФайл(Данные, Отказ);
				
				Если Отказ Тогда
					Сообщить(СтрШаблон("Не удалось выгрузить конфигурацию: %1", Конфигурация));
				КонецЕсли;
			Иначе
				Сообщить(СтрШаблон("Выгрузка хранилища для конфигурации %1 не предусмотрена", Конфигурация));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
