
Функция ПолучитьДиалогВыбораКаталога(Данные) Экспорт
	
	Диалог 						= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.ПолноеИмяФайла 		= Данные.ПолноеИмяФайла;
	Диалог.Фильтр 				= Данные.Фильтр;
	Диалог.Расширение			= Данные.Расширение;
	Диалог.МножественныйВыбор	= Данные.МножественныйВыбор;
	
	Возврат Диалог
	
КонецФункции

Функция ИнициализироватьСтруктуруДиалогаВыбораФайла() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ПолноеИмяФайла", "");
	Данные.Вставить("Фильтр", "");
	Данные.Вставить("Расширение", "");
	Данные.Вставить("МножественныйВыбор", Ложь);

	Возврат Данные
	
КонецФункции
