
#Область Команды

&НаКлиенте
Процедура СформироватьФайлНастроек(Команда)
	
	Результат = СформироватьФайлНастроекНаСервере(Объект.ВыпускРелиза);
	
	Если Результат <> Неопределено Тогда
		
		Данные = ПолучитьИзВременногоХранилища(Результат);
		
		Если Данные <> Неопределено Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			Данные.Записать(ИмяВременногоФайла);
			
			ФайлНастроек.Прочитать(ИмяВременногоФайла);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область Заполнение

&НаСервере
Функция СформироватьФайлНастроекНаСервере(ВыпускРелиза)
		
	Данные			= Обработки.Ар_СозданиеФайлаНастроекОбъединения.ИнициализироватьСтруктуруДанных();
	Данные.Источник	= ВыпускРелиза;
	
	Результат		= Обработки.Ар_СозданиеФайлаНастроекОбъединения.СформироватьФайлНастроекПоДанным(Данные);
	
	Возврат Результат
	
КонецФункции

#КонецОбласти

#Область Служебные

&НаКлиенте
Процедура СохранитьНаКлиенте()
	
	ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "MergeSettings.xml";
	ДиалогОткрытияФайла.Фильтр 				= "XML файлы (*.xml)|*.xml";
	ДиалогОткрытияФайла.Расширение			= "xml";
	ДиалогОткрытияФайла.МножественныйВыбор	= Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитЗавершениеНаКлиенте", ЭтаФорма);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СохранитЗавершениеНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ФайлНастроек.Записать(Результат[0]);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

