
Процедура ОбновитьСписокБаз() Экспорт
	
	СоответствиеДанных 	= Новый Соответствие;
	МассивКолонок 		= Новый Массив;
	МассивФайлов 		= ПолучитьМассивСписокБазФайлов();
	
	//заполним колонки
	МассивКолонок.Добавить("Name");
	
	Для Каждого Файл Из МассивФайлов Цикл
		
		ТекстовыйДокумент 	= Новый ТекстовыйДокумент();
		ТекстовыйДокумент.Прочитать(Файл.ПолноеИмя);
		КоличествоСтрок 	= ТекстовыйДокумент.КоличествоСтрок();
		
		Для Счетчик = 1 По КоличествоСтрок Цикл
			
			Строка = ТекстовыйДокумент.ПолучитьСтроку(Счетчик);
			
			Если СтрНайти(Строка, "[") > 0 Тогда
				
			ИначеЕсли СтрНайти(Строка, "=") > 0 Тогда
				
				НомерКлюча 	= СтрНайти(Строка, "=");
				Ключ 		= Сред(Строка, 1, НомерКлюча - 1);
				
				Если МассивКолонок.Найти(Ключ) = Неопределено Тогда
					МассивКолонок.Добавить(Ключ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Заполним данные
	Для Каждого Файл Из МассивФайлов Цикл
		
		ТекстовыйДокумент 	= Новый ТекстовыйДокумент();
		ТекстовыйДокумент.Прочитать(Файл.ПолноеИмя);
		КоличествоСтрок 	= ТекстовыйДокумент.КоличествоСтрок();
		ТекущаяБаза			= "";
		СтруктураБазы		= Новый Структура;
				
		Для Счетчик = 1 По КоличествоСтрок Цикл
			
			Строка = ТекстовыйДокумент.ПолучитьСтроку(Счетчик);
			
			Если СтрНайти(Строка, "[") > 0 Тогда
				
				Если ЗначениеЗаполнено(ТекущаяБаза)
					И СтруктураБазы.Количество() > 0 Тогда
					
					СтруктураБазы.Name = ТекущаяБаза;

					СоответствиеДанных[СтруктураБазы.ID] = СтруктураБазы;
					
				КонецЕсли;
				
				ТекущаяБаза 	= Строка;
				ТекущаяБаза		= СтрЗаменить(ТекущаяБаза, "[", "");
				ТекущаяБаза		= СтрЗаменить(ТекущаяБаза, "]", "");
				
				СтруктураБазы	= Новый Структура;
				
				Для Каждого Колонка Из МассивКолонок Цикл
					СтруктураБазы.Вставить(Колонка);
				КонецЦикла;
				
			ИначеЕсли СтрНайти(Строка, "=") > 0 Тогда
				
				НомерКлюча 	= СтрНайти(Строка, "=");
				Ключ 		= Сред(Строка, 1, НомерКлюча - 1);
				Значение	= Сред(Строка, НомерКлюча + 1);
				
				СтруктураБазы.Вставить(Ключ, Значение);
				
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТекущаяБаза)
			И СтруктураБазы.Количество() > 0 Тогда
			
			СтруктураБазы.Name = ТекущаяБаза;
			
			СоответствиеДанных[СтруктураБазы.ID] = СтруктураБазы;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Данные = Новый Структура();
	Данные.Вставить("МассивКолонок", МассивКолонок);
	Данные.Вставить("СоответствиеДанных", СоответствиеДанных);
	
	Ар_СписокБазВызовСервера.ОбновитьСписокБаз(Данные);
	
КонецПроцедуры

Функция ПолучитьМассивСписокБазФайлов()
	
	Массив = Новый Массив;
	
	МассивФайловВсехПользователей 	= НайтиФайлы("C:\ProgramData\1C\1CEStart\", "*.v8i", Истина);
	МассивФайловПользователя 		= НайтиФайлы(ПолучитьКаталогССпискомБазПользователя(), "*.v8i", Истина);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Массив, МассивФайловВсехПользователей);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Массив, МассивФайловПользователя);
	
	Возврат Массив
	
КонецФункции

Функция ПолучитьКаталогССпискомБазПользователя()
	
	Путь			= "";
	РабочийКаталог 	= РабочийКаталогДанныхПользователя();
	МассивПодстрок	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РабочийКаталог, "\", Истина);
	Счетчик			= 0;
	
	Пока МассивПодстрок[Счетчик] <> "1C"
		И Счетчик <= МассивПодстрок.Количество() - 1 Цикл
		
		Если Не ЗначениеЗаполнено(Путь) Тогда
			Путь 	= МассивПодстрок[Счетчик];
		Иначе
			Путь 	= СтрШаблон("%1\%2", Путь, МассивПодстрок[Счетчик]);
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Путь = СтрШаблон("%1\1C\1CEStart\", Путь);
	
	Возврат Путь
	
КонецФункции
