
#Область СозданиеБазы

// Функция - Выполнить команду создать файловую базу
//
// Параметры:
//  Данные	 - Структура - Данные выполнения для команды
//		Приложение1с - Строка - Путь к 1с	
//		Путь - Строка - Каталог создания базы	
// 
// Возвращаемое значение:
//  Результат - Число
//		0 - Успешно
//		Другое число - Ошибка
//"C:\Program Files (x86)\1cv8\common\1cestart.exe" CREATEINFOBASE File=C:\v8_temp;
Функция ВыполнитьКомандуСоздатьФайловуюБазу(Данные) Экспорт
	
	Результат = 999;
	
	ПутьТемп		= ПолучитьПутьКВременнойБазе(Данные.Путь);
	ТекстКоманды	= СтрШаблон("""%1"" CREATEINFOBASE File=%2", Данные.Приложение1с, ПутьТемп);
	
	ЗапуститьПриложение(ТекстКоманды,, Истина, Результат);
	
	Возврат Результат
	
КонецФункции

Процедура УдалитьФайловуюБазу(Путь) Экспорт
	
	Файл = Новый Файл(Путь);
	
	Если Файл.Существует() Тогда
		УдалитьФайлы(Путь);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПутьКВременнойБазе(Путь) Экспорт
	Возврат СтрШаблон("%1\v8_temp", Путь);
КонецФункции

#КонецОбласти

#Область Хранилище

// Процедура - Выгрузить конфигурацию в файл
//
// Параметры:
//  Данные	 - Структура - Данные выполнения для команды
//		Приложение1с - Строка - Путь к 1с	
//		Путь - Строка - Каталог создания базы	
//		КаталогХранилища - Строка - Путь к хранилищу	
//		ПользовательХранилища - Строка - пользователь хранилища	
//		ПарольПользователяВХранилище - Строка - пароль пользователя хранилища	
//		ПутьФайла - Строка - Путь результата выгрузки	
//  Отказ	 - Булево - результат выполнения
Процедура ВыгрузитьКонфигурациюВФайл(Данные, Отказ) Экспорт
	
	ПутьКВременнойБазе 	= ПолучитьПутьКВременнойБазе(Данные.Путь);
	Результат			= ВыполнитьКомандуСоздатьФайловуюБазу(Данные);
	
	Если Результат <> 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		//выгрузим в файл
		Результат = ВыполнитьКомандуВыгрузитьКонфигурациюВФайл(Данные);
		
		Если Результат <> 0 Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	//удалим базу
	Ар_РаботаСКоманднойСтрокойКлиентСервер.УдалитьФайловуюБазу(ПутьКВременнойБазе);
	
КонецПроцедуры

// Функция - Выполнить команду выгрузить конфигурацию в файл
//
// Параметры:
//  Данные	 - Структура - Данные выполнения для команды
//		Приложение1с - Строка - Путь к 1с	
//		Путь - Строка - Каталог создания базы	
//		КаталогХранилища - Строка - Путь к хранилищу	
//		ПользовательХранилища - Строка - пользователь хранилища	
//		ПарольПользователяВХранилище - Строка - пароль пользователя хранилища	
//		ПутьФайла - Строка - Путь результата выгрузки	
// 
// Возвращаемое значение:
//  Результат - Число
//		0 - Успешно
//		Другое число - Ошибка
//"C:\Program Files (x86)\1cv8\common\1cestart.exe" DESIGNER /FC:\v8_temp /ConfigurationRepositoryFtcp://srv1/test /ConfigurationRepositoryNtest 
///ConfigurationRepositoryPtest /ConfigurationRepositoryDumpCfgC:\v8_temp\1c_v8.cf
Функция ВыполнитьКомандуВыгрузитьКонфигурациюВФайл(Данные) Экспорт
	
	Результат = 999;
	
	ТекстКоманды	= СтрШаблон("""%1"" DESIGNER /F%2 /ConfigurationRepositoryF%3 /ConfigurationRepositoryN%4 /ConfigurationRepositoryP%5 /ConfigurationRepositoryDumpCfg%6", 
						Данные.Приложение1с, Данные.ПутьВременнойБазы, Данные.КаталогХранилища, Данные.ПользовательХранилища, Данные.ПарольПользователяВХранилище, Данные.ПутьФайла);
	
	ЗапуститьПриложение(ТекстКоманды,, Истина, Результат);
	
	Возврат Результат
	
КонецФункции

#КонецОбласти
