#Область Общее

Функция ПолучитьСтруктуруДанныхПоКонфигурации(Конфигурация) Экспорт
	
	ДанныеКонфигурации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конфигурация, "Приложение1с, КаталогХранилища, ПользовательХранилища, ПарольПользователяВХранилище,
							|ПолучатьИзмененияИзХранилища");
	
	Данные = Новый Структура();
	Данные.Вставить("Приложение1с", "");
	Данные.Вставить("Путь", "");
	Данные.Вставить("КаталогХранилища", "");
	Данные.Вставить("ПользовательХранилища", "");
	Данные.Вставить("ПарольПользователяВХранилище", "");
	Данные.Вставить("ПутьФайла", "");
	Данные.Вставить("ПолучатьИзмененияИзХранилища", Ложь);
	
	ЗаполнитьЗначенияСвойств(Данные, ДанныеКонфигурации);
	
	Возврат Данные
	
КонецФункции

#КонецОбласти
