
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СформироватьФайлНаКлиенте(ПараметрКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлНаКлиенте(Источник)
		
	Результат = СформироватьФайлНаСервереБезКонтекста(Источник);

	Если Результат <> Неопределено Тогда
		
		Данные = ПолучитьИзВременногоХранилища(Результат);
		
		Если Данные <> Неопределено Тогда
			СохранитьНаКлиенте(Данные);
		Иначе
			ПоказатьПредупреждение(, "Не удалось сформировать файл настроек",, "Внимание");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьФайлНаСервереБезКонтекста(Источник)
	
	Данные			= Обработки.Ар_СозданиеФайлаНастроекОбъединения.ИнициализироватьСтруктуруДанных();
	Данные.Источник	= Источник;
	
	Результат		= Обработки.Ар_СозданиеФайлаНастроекОбъединения.СформироватьФайлНастроекПоДанным(Данные);
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Процедура СохранитьНаКлиенте(Данные)
	
	ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "MergeSettings.xml";
	ДиалогОткрытияФайла.Фильтр 				= "XML файлы (*.xml)|*.xml";
	ДиалогОткрытияФайла.Расширение			= "xml";
	ДиалогОткрытияФайла.МножественныйВыбор	= Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитЗавершениеНаКлиенте", ЭтотОбъект, Данные);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СохранитЗавершениеНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Записать(Результат[0]);
	КонецЕсли;

КонецПроцедуры

