
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Данные = ПолучитьСвойстваКластераНаСервере(ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСвойстваКластераНаСервере(База)
	
	Отказ 	= Ложь;
	Данные 	= Ар_ИнформационныеБазы.ПолучитьПараметрыКластера(База, Отказ);
	
	Если Не Отказ Тогда
		СеансыИнформационнойБазы = АдминистрированиеКластера.СеансыИнформационнойБазы(Данные.ПараметрыКластера, Данные.ПараметрыИБ);
		//АдминистрированиеКластера.БлокировкаСеансовИЗаданийИнформационнойБазы(Данные.ПараметрыКластера, Данные.ПараметрыИБ)
		//АдминистрированиеКластера.БлокировкаРегламентныхЗаданийИнформационнойБазы(Данные.ПараметрыКластера, Данные.ПараметрыИБ)
		//АдминистрированиеКластера.СвойстваИнформационныхБаз(Данные.ПараметрыКластера, Данные.ПараметрыИБ)
		//АдминистрированиеКластера.БлокировкаСеансовИЗаданийИнформационнойБазы(Данные.ПараметрыКластера, Данные.ПараметрыИБ)
		//АдминистрированиеКластера.БлокировкаСеансовИЗаданийИнформационнойБазы(Данные.ПараметрыКластера, Данные.ПараметрыИБ)
	КонецЕсли;
		
	Возврат Данные
	
КонецФункции
