
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры,, "ЗакрыватьПриВыборе, ЗакрыватьПриЗакрытииВладельца, ТолькоПросмотр");
	
	БлокировкаСеансовЭталон 			= БлокировкаСеансов;
	БлокировкаРегламентныхЗаданийЭталон = БлокировкаРегламентныхЗаданий;
	КодРазрешенияЭталон 				= КодРазрешения;
	ПараметрБлокировкиЭталон 			= ПараметрБлокировки;
	СообщениеЭталон 					= Сообщение;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоманда(Команда)
	ИзменитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаКлиенте()
	
	Отказ = Ложь;
	
	Если БлокировкаСеансовЭталон <> БлокировкаСеансов
		Или БлокировкаРегламентныхЗаданийЭталон <> БлокировкаРегламентныхЗаданий
		Или КодРазрешенияЭталон <> КодРазрешения
		Или ПараметрБлокировкиЭталон <> ПараметрБлокировки
		Или СообщениеЭталон <> Сообщение Тогда
		
		Попытка
			
			Данные 									= Ар_ИнформационныеБазыВызовСервера.СвойстваБлокировокИнформационнойБазы(ПараметрыБлокировки.ПараметрыКластера, ПараметрыБлокировки.ПараметрыИБ);
			Данные.БлокировкаРегламентныхЗаданий 	= БлокировкаРегламентныхЗаданий;
			Данные.БлокировкаСеансов 				= БлокировкаСеансов;
			Данные.КодРазрешения 					= КодРазрешения;
			Данные.ПараметрБлокировки 				= ПараметрБлокировки;
			Данные.Сообщение 						= Сообщение;
			
			Ар_ИнформационныеБазыВызовСервера.УстановитьБлокировкуСеансовИЗаданийИнформационнойБазы(ПараметрыБлокировки.ПараметрыКластера, ПараметрыБлокировки.ПараметрыИБ, Данные);
			
		Исключение
			
			ПоказатьПредупреждение(, ИнформацияОбОшибке(),, "Внимание");
			Отказ = Истина;
			
		КонецПопытки;
		
		Если Отказ Тогда
			БлокировкаСеансов 					= БлокировкаСеансовЭталон;
			БлокировкаРегламентныхЗаданий 		= БлокировкаРегламентныхЗаданийЭталон;
			КодРазрешения 						= КодРазрешенияЭталон;
			ПараметрБлокировки 					= ПараметрБлокировкиЭталон;
			Сообщение 							= СообщениеЭталон;
		Иначе
			БлокировкаСеансовЭталон 			= БлокировкаСеансов;
			БлокировкаРегламентныхЗаданийЭталон = БлокировкаРегламентныхЗаданий;
			КодРазрешенияЭталон 				= КодРазрешения;
			ПараметрБлокировкиЭталон 			= ПараметрБлокировки;
			СообщениеЭталон 					= Сообщение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

