
Функция ПолучитьПараметрыКластера(База, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОтказКластера		= Ложь;
	ОшибкаКластера		= "";
	ОтказИБ				= Ложь;
	ОшибкаИБ			= "";
	Данные 				= Новый Структура("ПараметрыКластера, ПараметрыИБ, ОшибкаИБ, ОшибкаКластера, ОтказИБ, ОтказКластера, Отказ");
	ДанныеКоманды 		= Справочники.Ар_ИнформационныеБазы.ПолучитьДанныеВыполненияКомандыКонфигурации(База, "");
	МассивИмяКластера 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеКоманды.РасположениеИС.Кластер, ":");
	
	Если ДанныеКоманды.РасположениеИС.Тип = Перечисления.Ар_ТипыРасположенияИнформационныйБазы.НаСервере1СПредприятия Тогда
		
		ПараметрыКластера 									= АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
		ПараметрыКластера.ТипПодключения 					= "COM";
		ПараметрыКластера.АдресАгентаСервера                = ДанныеКоманды.РасположениеИС.Кластер;
		ПараметрыКластера.АдресСервераАдминистрирования     = ДанныеКоманды.РасположениеИС.Кластер;
		
		Если МассивИмяКластера.Количество() = 2 Тогда
			ПараметрыКластера.ПортКластера                  = МассивИмяКластера[1];
		КонецЕсли;
		
		ПараметрыИБ											= АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
		ПараметрыИБ.ИмяВКластере                            = ДанныеКоманды.РасположениеИС.ИмяИС;
		ПараметрыИБ.ИмяАдминистратораИнформационнойБазы     = ДанныеКоманды.Авторизация.Логин;
		ПараметрыИБ.ПарольАдминистратораИнформационнойБазы  = ДанныеКоманды.Авторизация.Пароль;
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыКластера, ДополнительныеПараметры);
		КонецЕсли;
		
		//проверим администрирования ИБ
		Попытка
			АдминистрированиеКластера.ПроверитьПараметрыАдминистрирования(ПараметрыКластера, ПараметрыИБ, Ложь, Истина);
		Исключение
			ОтказИБ 		= Истина;
			ОшибкаКластера 	= ИнформацияОбОшибке().Описание;
		КонецПопытки;
		
		//проверим администрирования кластера
		Попытка
			АдминистрированиеКластера.ПроверитьПараметрыАдминистрирования(ПараметрыКластера, ПараметрыИБ, Истина, Ложь);
		Исключение
			ОтказКластера 	= Истина;
			ОшибкаИБ 		= ИнформацияОбОшибке().Описание;
		КонецПопытки;
		
		Данные.ПараметрыКластера 	= ПараметрыКластера;
		Данные.ПараметрыИБ 			= ПараметрыИБ;
		
	КонецЕсли;
	
	Данные.ОтказКластера 		= ОтказКластера;
	Данные.ОшибкаКластера 		= ОшибкаКластера;
	Данные.ОтказИБ 				= ОтказИБ;
	Данные.ОшибкаИБ 			= ОшибкаИБ;
	Данные.Отказ				= ОтказКластера Или ОтказИБ;
	
	Возврат Данные;
	
КонецФункции
