
Функция ПолучитьПараметрыКластера(База, Отказ) Экспорт
	
	Данные 				= Новый Структура("ПараметрыКластера, ПараметрыИБ, ИдентификаторКластера");
	ДанныеКоманды 		= Справочники.Ар_ИнформационныеБазы.ПолучитьДанныеВыполненияКомандыКонфигурации(База, "");
	МассивИмяКластера 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеКоманды.РасположениеИС.Кластер, ":");
	
	Если ДанныеКоманды.РасположениеИС.Тип = Перечисления.Ар_ТипыРасположенияИнформационныйБазы.НаСервере1СПредприятия Тогда
		
		ПараметрыКластера 									= АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
		ПараметрыКластера.ТипПодключения 					= "COM";
		ПараметрыКластера.АдресАгентаСервера                = ДанныеКоманды.РасположениеИС.Кластер;
		ПараметрыКластера.АдресСервераАдминистрирования     = ДанныеКоманды.РасположениеИС.Кластер;
		
		Если МассивИмяКластера.Количество() = 2 Тогда
			ПараметрыКластера.ПортКластера                  = МассивИмяКластера[1];
		КонецЕсли;
		
		ПараметрыИБ											= АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
		ПараметрыИБ.ИмяВКластере                            = ДанныеКоманды.РасположениеИС.ИмяИС;
		ПараметрыИБ.ИмяАдминистратораИнформационнойБазы     = ДанныеКоманды.Авторизация.Логин;
		ПараметрыИБ.ПарольАдминистратораИнформационнойБазы  = ДанныеКоманды.Авторизация.Пароль;

		Попытка
			АдминистрированиеКластера.ПроверитьПараметрыАдминистрирования(ПараметрыКластера, ПараметрыИБ);
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
		Если Не Отказ Тогда
			ИдентификаторКластера = АдминистрированиеКластера.ИдентификаторКластера(ПараметрыКластера);
		КонецЕсли;
		
		Данные.ПараметрыКластера 		= ПараметрыКластера;
		Данные.ПараметрыИБ 				= ПараметрыИБ;
		Данные.ИдентификаторКластера 	= ИдентификаторКластера;
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции
