
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыПереопределения = ПолучитьПараметрыПереопределенияНаКлиенте(ПараметрыВыполненияКоманды);
		
	Ар_ИнформационныеБазыКлиент.ЗапуститьПредриятие(ПараметрКоманды, ПараметрыПереопределения);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыПереопределенияНаКлиенте(ПараметрыВыполненияКоманды)
	
	ПараметрыПереопределения = Новый Структура();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВыполненияКоманды.Источник, "ТекущаяРазрядность") Тогда
		ПараметрыПереопределения.Вставить("Разрядность", ПараметрыВыполненияКоманды.Источник.ТекущаяРазрядность);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВыполненияКоманды.Источник, "ТекущийРежимЗапуска") Тогда
		ПараметрыПереопределения.Вставить("РежимЗапуска", ПараметрыВыполненияКоманды.Источник.ТекущийРежимЗапуска);
	КонецЕсли;
	
	Возврат ПараметрыПереопределения;
	
КонецФункции
