
#Область ДействияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИнициализироватьНаКлиенте(Отказ);
КонецПроцедуры

#КонецОбласти

#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ТипРасположенияИнформационныйБазыПриИзменении(Элемент)
	ИзменитьВидимостьСтраницТипыРасположенияИнформационныйБазыНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область Команды

#КонецОбласти

#Область Заполнение

&НаКлиенте
Процедура ИнициализироватьНаКлиенте(Отказ)
	ИзменитьВидимостьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьНаКлиенте()
	ИзменитьВидимостьСтраницТипыРасположенияИнформационныйБазыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьСтраницТипыРасположенияИнформационныйБазыНаКлиенте()
	
	Элементы.СтраницыТипыРасположенияИнформационнойБазы.ОтображениеСтраниц 	= ОтображениеСтраницФормы.Нет;
	
	Если Объект.ТипРасположенияИнформационныйБазы = ПредопределенноеЗначение("Перечисление.Ар_ТипыРасположенияИнформационныйБазы.НаДанномКомпьютереИлиНаКомпьютереВЛокальнойСети") Тогда
		Элементы.СтраницыТипыРасположенияИнформационнойБазы.ТекущаяСтраница		= Элементы.СтраницаНаДанномКомпьютереИлиНаКомпьютереВЛокальнойСети;
	ИначеЕсли Объект.ТипРасположенияИнформационныйБазы = ПредопределенноеЗначение("Перечисление.Ар_ТипыРасположенияИнформационныйБазы.НаВебСервере") Тогда
		Элементы.СтраницыТипыРасположенияИнформационнойБазы.ТекущаяСтраница		= Элементы.СтраницаНаВебСервере;
	ИначеЕсли Объект.ТипРасположенияИнформационныйБазы = ПредопределенноеЗначение("Перечисление.Ар_ТипыРасположенияИнформационныйБазы.НаСервере1СПредприятия") Тогда
		Элементы.СтраницыТипыРасположенияИнформационнойБазы.ТекущаяСтраница		= Элементы.СтраницаНаСервере1СПредприятия;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Общее

#КонецОбласти
